app/views/posts/_form.html.erb

SELECT  "cover_letters".* FROM "cover_letters" WHERE "cover_letters"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
---
        <%= f.label :custom_cover_letter, "Custom Cover Letter" %> <br>
        <%= f.text_area :custom_cover_letter, :value => CoverLetter.find(16).body %>