app/controllers/cover_letters_controller.rb

    def index
        @cover_letters = CoverLetter.all.order('created_at DESC')
---
SELECT "cover_letters".* FROM "cover_letters" ORDER BY created_at DESC

    def create
        @cover_letter = CoverLetter.new(cover_letter_params)

        if @cover_letter.save
---
INSERT INTO "cover_letters" ("body", "created_at", "updated_at", "name") VALUES (?, ?, ?, ?)  [["body", "dassdas"], ["created_at", "2017-09-05 22:10:33.112067"], ["updated_at", "2017-09-05 22:10:33.112067"], ["name", "NAME"]]

    def show
        @cover_letter = CoverLetter.find(params[:id])
---
SELECT  "cover_letters".* FROM "cover_letters" WHERE "cover_letters"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]

    def edit
        @cover_letter = CoverLetter.find(params[:id])
---
SELECT  "cover_letters".* FROM "cover_letters" WHERE "cover_letters"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def update
        @cover_letter = CoverLetter.find(params[:id])

        if @cover_letter.update(params[:cover_letter].permit(:name, :body))
---
SELECT  "cover_letters".* FROM "cover_letters" WHERE "cover_letters"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "cover_letters" SET "body" = ?, "updated_at" = ? WHERE "cover_letters"."id" = ?  [["body", "here is my second cover letter fdhjsfklsdjfdskjhfdsf"], ["updated_at", "2017-09-05 19:24:45.328415"], ["id", 2]]

    def destroy
        @cover_letter = CoverLetter.find(params[:id])
        @cover_letter.destroy
---
SELECT  "cover_letters".* FROM "cover_letters" WHERE "cover_letters"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "cover_letters" WHERE "cover_letters"."id" = ?  [["id", 1]]