app/controllers/posts_controller.rb

    def create
        @post = Post.new(post_params)

        self.toggle_placeholder_text('[COMPANY]', @post.company_name, '[POSITION]', @post.position_title)

        if @post.save
---
INSERT INTO "posts" ("company_name", "notes", "created_at", "updated_at", "position_title") VALUES (?, ?, ?, ?, ?)  [["company_name", "blahHHHH"], ["notes", "VCCXVCXVCVCVCVXCV"], ["created_at", "2017-08-31 00:58:02.502037"], ["updated_at", "2017-08-31 00:58:02.502037"], ["position_title", "ENGINNEEEEERRRRR"]]

    def edit
        @post = Post.find(params[:id])
        self.toggle_placeholder_text(@post.company_name, '[COMPANY]', @post.position_title, '[POSITION]' )
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "posts" SET "custom_cover_letter" = ?, "updated_at" = ? WHERE "posts"."id" = ?

    def update
        @post = Post.find(params[:id])

        if @post.update(params[:post].permit(:company_name, :position_title, :job_description, :custom_cover_letter))
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "posts" SET "company_name" = ?, "position_title" = ?, "job_description" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["company_name", "hifdsfds"], ["position_title", "hellofdsfs"], ["job_description", "ddasdad"], ["updated_at", "2017-09-13 21:09:27.144287"], ["id", 36]]